test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no
#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]

** Table column alignment
:PROPERTIES:
:EXPORT_FILE_NAME: table-column-alignment
:END:
*** Table with 3 rows
|             <r> | <l>                  |           |              <c>              |
|           Right | Left                 | No        |            Center             |
| Long Content To | Spread Out the Width | Alignment | Of the Table To See Alignment |
|           Right | Left                 | Marker    |            Center             |
*** Table with 2 rows
| <l>  |         |  <c>   |   <r> |
| Left | Default | Center | Right |
| 1    |       2 |   3    |     4 |
*** Table with 1 row
/A table with just 1 row with alignment markers is as good as just
that row without the alignment markers. But hey, a test is a test./

| <l>  |         |  <c>   |   <r> |
| Left | Default | Center | Right |
*** Table with 0 rows!
/A table with zero rows, with just alignment markers, doesn't make
sense. But hey, a test is a test./

| <l> |   | <c> | <r> |

You should see *no* table exported above.
